---
kind: enumMember
id: F:Autodesk.Revit.DB.ColumnAttachmentCutStyle.CutColumn
enum: Autodesk.Revit.DB.ColumnAttachmentCutStyle
source: html/bf9f4c1b-976d-f0ec-9375-4ff56c621df6.htm
---
# Autodesk.Revit.DB.ColumnAttachmentCutStyle.CutColumn